Repository: shimsw20/theorem_proving_in_lean4
Catalog: locale/kr/kr-level2.tmx
Source language: en_us
Languages: ko

source: See the Setting Up Lean section of the Lean 4 Manual to install Lean.
ko: Lean을 설치하려면 Lean 4 Manual의 Setting Up Lean section을 보세요.

source: Setting Options
ko: 옵션 설정하기

source: Similarly, Iff.mpr h produces a proof of q → p from h : p ↔ q.
ko: 마찬가지로 Iff.mpr h는 h : p ↔ q으로부터 q → p의 증명을 생성합니다.

source: Similarly, And.right h is a proof of q.
ko: 마찬가지로 And.right h는 q의 증명입니다.

source: Similarly, Or.intro_right p hq creates a proof for p ∨ q using a proof hq : q.
ko: 마찬가지로 Or.intro_right p hq는 hq : q의 증명을 사용하여 p ∨ q 의 증명을 만듭니다.

source: Similarly, Lean detects the occurrence of x in t1 and t2, and inserts it automatically there, too.
ko: 마찬가지로 린은 t1와 t2에서 x의 나타남을 감지하고 거기에도 자동적으로 그것을 삽입합니다.

source: Similarly, an object r : α → α → Prop denotes a binary relation on α: given x y : α, r x y denotes the assertion that x is related to y.
ko: 마찬가지로 대상 r : α → α → Prop은 α에 대한 이항 관계 즉, x y : α이 주어진다면 , r x y은 x가 y에 연관된다는 주장을 지칭합니다.

source: Similarly, define the type of propositional formulas, as well as functions on the type of such formulas: an evaluation function, functions that measure the complexity of a formula, and a function that substitutes another formula for a given variable.
ko: 비슷하게 계산 함수와 공식의 복잡도를 측정하는 함수 및 제시한 변수로 다른 식에 대입하는 함수와 마찬가지인 명제 논리식의 유형을 정의하세요.

source: Similarly, if you use an open command within a namespace, its effects disappear when the namespace is closed.
ko: 마찬가지로 여러분이 이름공간 내에서 open 명령을 사용한다면 그것의 효과는 이름공간이 닫힐 때 사라질 것 입니다.

source: Similarly, many theorems hold under the additional assumption that a type is not empty.
ko: 마찬가지로 많은 정리는 유형이 비어 있지 않을 때 덧셈 가정에 대해서 성립합니다.

source: Similarly, methods of elaboration and type inference, which can be used to support flexible forms of algebraic reasoning.
ko: 비슷하게 대수 추론의 유연한 형태를 지원하는데 사용될 수 있는 협력법과 유형 추론

source: Similarly, most identities can be proved by introducing suitable match, and then using rfl.
ko: 마찬가지로 대부분의 항등식들은 적절한 match와 그 뒤 rfl를 쓰는 것으로 증명될 수 있습니다.

source: Similarly, see if you can figure out how to define WellFounded.fix on your own.
ko: 마찬가지로 여러분은 여러분 스스로 WellFounded.fix을 정의하는 법을 알아낼 수 있는지 볼 것입니다.

source: Similarly, the expression hnp hp produces a proof of False from hp : p and hnp : ¬p.
ko: 마찬가지로 표현식 hnp hp은 hp : p과 hnp : ¬p으로부터 False의 증명을 만듭니다.

source: Similarly, two dashes -- indicate that the rest of the line contains a comment that is also ignored.
ko: 마찬가지로 두 개의 대시 --는 이 줄의 나머지는 주석을 포함함을 나타내고 이 또한 무시됩니다.

source: Similarly, use the equation compiler to define some basic operations on lists (like the reverse function) and prove theorems about lists by induction (such as the fact that reverse (reverse xs) = xs for any list xs).
ko: 마찬가지로 방정식 컴파일러를 리스트에 대한 몇 가지 기본 연산(reverse 함수 같은)을 정의하는데 사용하세요. 그리고 귀납법으로 리스트에 대한 정리(임의의 리스트 xs에 대해 reverse (reverse xs) = xs이라는 사실 같은 것)를 증명하세요.

source: Similarly, we can think of an implication p → q between propositions as the special case of ∀ x : p, q in which the expression q does not depend on x.
ko: 마찬가지로 우리는 명제들 사이의 함의 p → q를 ∀ x : p, q의 특별한 경우로써 생각할 수 있습니다. 이때 q는 x에 의존하지 않습니다.

source: Similarly, we can inhabit type function with suitable constant functions:
ko: 마찬가지로 우리는 유형 함수를 적절한 상수 함수로 내재시킬 수 있습니다.

source: Similarly, we can register an instance by
ko: 마찬가지로 우리는 개체를 다음과 같이 등록할 수 있습니다.

source: Simple Type Theory
ko: 단순 유형론(Simple Type Theory)

source: Since addition is defined by recursion on the second argument, k is a good guess, and once we make that choice the proof almost writes itself:
ko: 덧셈은 두 번째 인수에 대해 재귀적으로 정의되어 있기 때문에 k는 좋은 추측입니다. 그리고 한번 우리가 그 선택을 하면 증명은 거의 술술 써집니다.

source: Since an inductive type lives in Sort u for some u, it is reasonable to ask which universe levels u can be instantiated to.
ko: 귀납형이 어떤 u에 대해 Sort u에 속해 있기 때문에, 어느세계의 수준에 u가 개체화 될 수 있는지 묻는 것은 합리적입니다.

source: Since many of these are already defined in Lean's core library, you should work within a namespace named Hidden, or something like that, in order to avoid name clashes.
ko: 이미 이들 중 다수가 이미 린의 중앙 라이브러리에 정의되어 있기에 여러분은 Hidden 혹은 이름 충돌을 피할 수 있는 것으로 이름지은 이름공간에서 작업해야만 합니다.

source: Since the values of m and n are not needed, we can just as well use wildcard patterns instead.
ko: m과 n의 값은 필요하지 않으므로 우리는 와일드카드 패턴을 대신 사용하여도 됩니다.

source: Singleton elimination is also used with heterogeneous equality and well-founded recursion, which will be discussed in a later chapter.
ko: 한 번에 하나씩 제거는 동일하지 않은 동등석과 잘 세워진 제귀에도 사용됩니다. 이것은 이후에 논의할 예정입니다.

source: So the expressions in the first two #check commands below are elaborated in the same way, whereas the third #check command interprets 2 as an integer.
ko: 그래서 아래 첫 두 #check명령에서 표현식은 같은 방식으로 해석됩니다. 반면 세 번째 #check 명령은 2를 정수로 해석합니다.

source: So def can also be used to simply name a value like this:
ko: 그래서 def는 이 같은 값을 단순히 이름으로 쓸 수 있습니다.

source: So constructing an element t : p tells us that p is indeed true.
ko: 그러므로 원소 t : p을 생성하는 것은 p가 사실이라고 우리에게 알립니다.

source: So far, you have seen that Lean allows you to introduce inductive types with any number of recursive constructors.
ko: 지금까지 여러분은 린이 여러분에게 재귀적인 생성자에 대한 임의의 수로 유도형을 도입하게 해줌을 보았습니다.

source: So if we have p q r : Prop, the expression p → q → r reads "if p, then if q, then r." This is just the "curried" form of p ∧ q → r.
ko: 그래서 만약 p q r : Prop이 있다면 표현식 p → q → r은 "p이면 그러면q이면r이다."로 읽습니다. 이는 p ∧ q → r의 "커리된(curried)" 형태일 뿐입니다.

source: So it makes sense to take the type to be the first argument to cons, so that for any type, α, cons α is the insertion function for lists of type α.
ko: 그래서 cons의 첫번째 인수의 유형으로 임의의 유형 α를 받아들이게 하는게 타당합니다. cons α는 α유형을 원소로 하는 리스트에 대한 삽입 함수입니다.

source: So, for example, we could have used the same variable, x, in both the hypothesis and conclusion, and instantiated it by a different variable, z, in the proof:
ko: 그럼 예를들어 우리가 같은 변수 x 가정과 결론 양쪽에 사용할 수 있어야 합니다. 그리고 증명에서 다른 변수 z에 의해 이것이 개체화됩니다.

source: So, for example, you can write fun x => g (f x) instead of fun x : Nat => g (f x).
ko: 그래서 여러분은 fun x : Nat => g (f x)대신에 fun x => g (f x)와 같이 쓸 수 있습니다.

source: So, if t ordinarily only effects the current goal, focus (all_goals t) has the same effect as t.
ko: 그래서 만약 t이 똑같이 현재 목표에만 영향을 미친다면 focus (all_goals t)은 t와 같은 효과를 갖습니다.

source: So, you can define instances for particular numerals.
ko: 그래서 여러분은 특정 수치에 대해 개체를 정의할 수 있습니다.

source: Some additional tactics are useful for constructing and destructing propositions and data.
ko: 몇 가지 추가적인 전략들은 명제와 데이터를 생성하고 파괴하는데 유용합니다.

source: Some functional programming languages support incomplete patterns.
ko: 어떤 함수형 프로그래밍 언어는 불완전한 패턴 기능을 지원합니다.

source: Some mathematically common examples of operations of functions can be described in terms of lambda abstraction:
ko: 수학적으로 흔한 함수 연산 예제는 람다 추상화에 대한 것으로 설명될 수 있습니다.

source: Some operations, however, need to be polymorphic over type universes.
ko: 그러나 몇몇 연산은 유형 세계에 대해 다형적(polymorphic)일 필요가 있습니다.

source: Some simplifications are possible, however.
ko: 하지만 몇 가지 단순화는 가능합니다.

source: Something funny is going on: if v has type Vector α (succ n), it can't be nil, but it is not clear how to tell that to casesOn.
ko: 무언가 재밌는 일이 일어나고 있습니다. 만약 v가 Vector α (succ n)형이고 그것은 nil일 일 수 없습니다. 그러나 casesOn에 대해 구별하는 법이 명확하지 않습니다.

source: Sometimes Lean can't find an instance because the class is buried under a definition.
ko: 때때로 린은 클래스가 정의에 묻혀 있어 개채를 찾지 못할 수 있습니다.

source: Sometimes an argument in a dependent matching pattern is not essential to the definition, but nonetheless has to be included to specialize the type of the expression appropriately.
ko: 떄때로 종속 매칭 패턴에서 인수는 정의에 반드시 필요하지 않습니다. 그럼에도 표현식의 유형을 적절하게 특수화하는데 포함될 필요가 있습니다.

source: Sometimes the left-hand side of an identity can match more than one subterm in the pattern, in which case the rw tactic chooses the first match it finds when traversing the term.
ko: 때때로 항등식의 좌변은 패턴의 한개 이상의 부분항과 동일할 수 있습니다. 그 경우 rw 전략은 항들을 가로지면서 처음 일치하는 것을 찾고 선택합니다.

source: Sometimes, however, it is useful to limit the scope of a variable.
ko: 그러나 때때로 변수의 범위를 제한하는 것이 유용합니다.

source: Sometimes, however, we may find ourselves in a situation where we have declared an argument to a function to be implicit, but now want to provide the argument explicitly.
ko: 하지만 때때로 우리는 우리 스스로 함수에 대한 인수가 암시적이도록 선언하는 걸 발견합니다. 그러나 지금 인수를 명시적으로 제공하길 원합니다.

source: Special modes in Visual Studio Code (VS Code for short) and Emacs offer powerful support for writing and debugging proofs, and is much better suited for serious use.
ko: 비주얼 스튜디오 코드(짧게는 VS code)에서 특정 모드와 Emacs는 강력한 편집 기능과 증명 디버깅 기능을 지원합니다. 그리고 진지한 사용을 생각한다면 이게 훨씬 적합합니다.

source: Specifically, congrArg can be used to replace the argument, congrFun can be used to replace the term that is being applied, and congr can be used to replace both at once.
ko: 구체적으로 congrArg은 인수를 대체하는데 사용될 수 있습니다. congrFun은 적용된 항을 대체하는데 사용할 수 있습니다. 그리고 congr는 한번에 둘 다 대체하는데 사용될 수 있습니다.

source: Start writing the proof from the top down, using sorry to fill in subproofs.
ko: 하향식으로 증명 작성을 하작하려면 보조 증명에 sorry를 채워 사용하세요.

source: Structural Recursion and Induction
ko: 구조적 재귀와 귀납

source: Structuring Tactic Proofs
ko: 전략 증명 구조화하기

source: Structuring conversion tactics
ko: 전환 전술 구조화하기

source: Such a function is polymorphic: you expect the cons function for Nat, Bool, or an arbitrary type α to behave the same way.
ko: 이러한 함수는 polymorphic입니다. 여러분은 cons는 Nat, Bool 혹은 임의의 유형 α에 대해 동일한 방식으로 동작해야 한다고 기대합니다.

source: Such examples of dependent pattern matching are considered in the Section Dependent Pattern Matching.
ko: 그런 종속적인 패턴 매칭의 예제는 종속적인 패턴 매칭 섹션에서 다뤄집니다.

source: Such parameters are simply added to the local context before the definition is processed.
ko: 그런 매개변수들은 단순히 정의가 처리되기 전에 지역 상황에 추가됩니다.

source: Such systems can have bugs, and it can be difficult to ensure that the results they deliver are correct.
ko: 이런 시스템들은 버그가 생길 수 있고, 그들이 올바르다고 도출한 결과를 확실히 보장하기가 어려울 수 있습니다.

source: Sugar for Simple Functions
ko: 간단한 함수를 위한 설탕

source: Suppose that, assuming p as a hypothesis, we have a proof of q.
ko: p를 가정으로 하면 q의 증명을 가질 수 있다는 것입니다.

source: Suppose we define a function f (x : Nat) {y : Nat} (z : Nat) with the arguments shown.
ko: 우리가 인수를 제시하여 함수 f (x : Nat) {y : Nat} (z : Nat)을 정의했다고 합시다.

source: Suppose we have α : Sort i and β : Sort j, where the expression β may depend on a variable x : α.
ko: 우리가 α : Sort i과 β : Sort j을 갖고 있다고 가정합시다. 여기서 표현식 β는 변수 x : α에 의존할 수도 있습니다.

source: Suppose we have an implementation of lists as:
ko: 우리가 리스트의 구현을 다음과 같이 했다고 가정합시다.

source: Suppose we try to prove the commutativity of addition.
ko: 우리가 덧셈에 교환성을 증명하려고 한다 가정합시다.

source: Suppose we want to prove example (fun x : Nat => 0 + x) = (fun x => x).
ko: 예제 (fun x : Nat => 0 + x) = (fun x => x)을 증명하고 싶다고 해봅시다.

source: Suppose you have the variable x : α and you can construct an expression t : β, then the expression fun (x : α) => t, or, equivalently, λ (x : α) => t, is an object of type α → β.
ko: 여러분이 변수 x : α를 갖고 있고 표현식 t : β을 만들 수 있다 가정합시다. 그러면 표현식fun (x : α) => t 또는 등가적으로 λ (x : α) => t은 α → β 유형인 대상입니다.

source: Suppose you wish to write a function cons which inserts a new element at the head of a list.
ko: 여러분이 리스트의 머리에 새 원소를 삽입하는 함수 cons를 만들기 원한다 해봅시다.

source: Suppose, however, that β is of Sort 0, that is, an element of Prop.
ko: 그러나 β가 Sort 0형이라고 가정하면 즉, Prop의 원소라면

source: Systems of natural deduction for propositional logic also typically rely on the following rule:
ko: 명제논리의 자연 영역에 대한 체계은 주로 다음 규칙에 의존합니다.

source: TO DO: eventually, describe using_well_founded.
ko: 할 것: 결국, 잘 세워진을 사용하는 것을 기술하기.

source: Tactic commands can take compound expressions, not just single identifiers.
ko: 전략 명령은 하나의 식별자 뿐만 아니라 복합된 식을 받을 수 있습니다.

source: Tactics for Inductive Types
ko: 귀납형에 대한 전략

source: Tactics often provide an efficient way of building a proof, but long sequences of instructions can obscure the structure of the argument.
ko: 전략들은 종종 증명을 세우는데 효율적인 방식을 제공합니다. 그러나 지시사항들의 긴 나열은 인수(argument)의 구조를 모호하게 할 수 있습니다.

source: Tactics that may produce multiple subgoals often tag them.
ko: 다수의 하위 목표를 생성할 수 있는 전략은 이들에 표식을 붙입니다.

source: Taking the left conjunct gives the desired conclusion, p y.
ko: 왼쪽의 결합자를 취하는 것은 원하는 결론 p y을 줍니다.

source: That assignment can also be made local:
ko: 그 배정는 지역적으로 만들어 질 수도 있습니다.

source: That command, which will be explained in Chapter Type Classes, works by assigning an [instance] attribute to the associated definition.
ko: Chapter Type Classes에서 설명할 그 명령은 연관된 정의에 [instance] 특성을 배정하는 것으로 동작합니다.

source: That expression is syntactic sugar for ite p a b, where ite is defined as follows:
ko: 그 표현식은 ite p a b에 대한 문법적 설탕입니다. 여기서 ite 다음과 같이 정의됩니다.

source: That is, an instance declaration can in turn depend on an implicit instance of a type class.
ko: 즉, 개체 선언은 유형 클래스의 암시적인 개체에 차례로 의존하게 할 수 있습니다.

source: That is, given h1 : a = b and h2 : p a, we can construct a proof for p b using substitution: Eq.subst h1 h2.
ko: 즉, h1 : a = b과 h2 : p a에 대해 p b에 대한 증명을 Eq.subst h1 h2과 같은 대체를 사용하여 만들 수 있습니다.

source: That is, in dite c t e, we can assume hc : c in the "then" branch, and hnc : ¬ c in the "else" branch.
ko: 즉, dite c t e에서 우리는 hc : c를 "then" 분기 그리고 "else" 분기에서 hnc : ¬ c라고 가정할 수 있습니다.

source: The rewrite and simp tactics tend to be very effective in proofs like these.
ko: rewrite와 simp 전략은 이 같은 증명에서 아주 효과적인 경향이 있습니다.

source: The structure command also allows us to define new structures based on previously defined ones.
ko: 또 structure 명령은 이전에 정의한 구조체에 기반한 새 구조체를 정의하도록 허용합니다.

source: The canonical way to prove ∀ y : α, p y is to take an arbitrary y, and prove p y.
ko: ∀ y : α, p y을 증명하는 표준 방법은 임의의 y를 받고 p y임을 증명하는 것 입니다.

source: The command
ko: 명령

source: The constructors all live in the Weekday namespace.
ko: 생성자는 모두 Weekday 이름공간에 살고 있습니다.

source: The definition of equality is atypical, however; see the discussion in the next section.
ko: 하지만 동등성의 정의는 전형적이지 않습니다. 다음 섹션의 논의를 보세요.

source: The difference is that given hp : p and hq : q, And.intro hp hq has type p ∧ q : Prop, while Prod hp hq has type p × q : Type.
ko: 차이는 hp : p와 hq : q가 주어졌을 때 And.intro hp hq는 p ∧ q : Prop형을 갖는 한편 Prod hp hq는 p × q : Type형을 갖는다는 것입니다.

source: The distinction is only useful in constructive mathematics; classically, every proposition is decidable.
ko: 이 구별은 직관주의적 수학에서만 유용합니다. 고전적으로 모든 명제는 결정 가능합니다.

source: The elimination rules provide for a principle of recursion on the type, which includes, as a special case, a principle of induction as well.
ko: 제거 규칙은 유형의 재귀의 원리를 제공합니다. 이것은 특별한 경우로서 귀납의 원리도 포합합니다.

source: The function F provides the inductive recipe for doing that: it tells us how to construct an element C x, given elements of C y for each predecessor y of x.
ko: 함수 F는 그것을 하는데 귀납적인 요리법을 제공합니다. 이것은 x의 각 선행자 y에 대해C y의 원소가 주어진 경우 원소 C x를 생성하는 법을 우리에게 말해줍니다.

source: The properties above are stated for the natural numbers (type Nat).
ko: 위의 성질들은 자연수 (type Nat)에 대해 기술되었습니다.

source: The type Foo consists of nothing more than the objects that are constructed in this way.
ko: Foo 유형은 이 방식으로 생성된 대상 외에 아무것도 갖고있지 않습니다.

source: The (unstructured) cases is particularly useful when you can close several subgoals using the same tactic.
ko: (비구조화된)cases는 여러분이 여러 개의 하위목표를 같은 전략을 사용해 끝낼 때 특히 유용합니다.

source: The try tactic ensures that the sequential composition succeeds.
ko: try 전략은 순차적인 함성 성공을 보장합니다.

source: The ; can be omitted when a line break is used.
ko: 세미콜론;은 줄을 분리할 때 사용되므로 생략될 수 있습니다.

source: The Bool type in the Lean library is an instance of enumerated type.
ko: 린 라이브러리에서 Bool형은 열거 유형의 개체입니다.

source: The Decidable type class also provides a bit of small-scale automation for proving theorems.
ko: Decidable 유형 클래스는 정리 증명에 대한 아주 작은 소규모의 자동화도 제공합니다.

source: The Lean Theorem Prover aims to bridge the gap between interactive and automated theorem proving, by situating automated tools and methods in a framework that supports user interaction and the construction of fully specified axiomatic proofs.
ko: Lean 증명 보조기는 사용자의 상호작용과 완전히 구체화된 공리적 증명의 생성을 돕는 자동화된 도구와 방법들을 프레임워크에 둠으로써 상호작용과 자동화된 정리 증명 사이의 빈틈을 메우는 것을 목표로 합니다.

source: The Lean project was launched by Leonardo de Moura at Microsoft Research Redmond in 2013.
ko: Lean 프로젝트는 마이크로소프트 연구소 Redmond의 Leonardo de Moura가 2013년 시작했습니다.

source: The Mul class is convenient for types that only implement the homogeneous multiplication.
ko: Mul 클래스는 동형 곱셈만 구현된 유형에 대해 편리합니다.

source: The Nat.recOn is similar to Nat.rec but the major premise occurs before the minor premises.
ko: Nat.recOn은 Nat.rec과 비슷하지만 주요 전제는 사소한 전제보다 먼저 일어납니다.

source: The OfNat instance is parametric on the numeral.
ko: OfNat 개체는 수치에 대해 매개적입니다.

source: The apply tactic applies an expression, viewed as denoting a function with zero or more arguments.
ko: apply 전략은 0 또는 그 이상의 인수가 있는 함수를 나타내는 것으로 간주되는 표현식을 적용합니다.

source: The assumption tactic looks through the assumptions in context of the current goal, and if there is one matching the conclusion, it applies it.
ko: assumption 전략은 현재 목표의 맥락 속 가정을 훝어 봅니다. 그리고 결론과 대응되는 가정이 있다면 그것을 목표에 적용합니다.

source: The calc command can be configured for any relation that supports some form of transitivity.
ko: calc 명령은 전달성의 몇몇 형태를 지원하는 어떤 관계에 대해서 설정될 수 있습니다.

source: The case tactic is clever, in that it will match the constructor to the appropriate goal.
ko: case 전략은 적절한 목표에 대한 생성자를 짝지어준다는 점에서 영리합니다.

source: The cases tactic can also be used to decompose a conjunction.
ko: cases 전략은 결합자를 분해하는데 사용될 수 있습니다.

source: The cases tactic will also do a case distinction on a natural number:
ko: cases 전략은 자연수에 대해 경우를 나눌 수도 있습니다.

source: The cases tactic works on elements of an inductively defined type, and does what the name suggests: it decomposes the element according to each of the possible constructors.
ko: cases 전략은 재귀적으로 정의된 유형의 원소와 이름이 제안하는 것에 작용합니다. 이것은 가능한 생성자들의 각각에 따라 원소를 분리한다.

source: The cases tactic, and its companion, the induction tactic, are discussed in greater detail in the Tactics for Inductive Types section.
ko: cases 전략 그리고 그것의 동반자인 induction 전략은 Tactics for Inductive Types 섹션에서 더욱 상세히 논의될 예정입니다.

source: The contradiction tactic searches for a contradiction among the hypotheses of the current goal:
ko: contradiction 전략은 현재 목표의 가정 사이에 모순을 탐색합니다.

source: The def keyword declares new constant symbols into the working environment.
ko: def는 작업 환경에 새로운 상수기호를 선언합니다.

source: The example command states a theorem without naming it or storing it in the permanent context.
ko: example 명령은 이름이 없이 영구적인 맥락으로 저장하지 않는 정리를 기술합니다.

source: The first | t₁ | t₂ | ... | tₙ applies each tᵢ until one succeeds, or else fails:
ko: first | t₁ | t₂ | ... | tₙ은 각각의 tᵢ에 대해 이 중 하나가 성공하거나 실패할 때까지 적용됩니다.

source: The induction tactic also supports user-defined induction principles with multiple targets (aka major premises).
ko: induction 전략은 (주요 전제라고도 하는) 다수의 타겟을 갖는 사용자 정의 귀납 원리도 지원합니다.

source: The inductive command creates a new type, Weekday.
ko: inductive 명령은 새로운 유형 Weekday를 만듭니다.

source: The injection tactic also detects contradictions that arise when different constructors are set equal to one another, and uses them to close the goal.
ko: injection 전략은 서로 다른 생성자들이 서로 같도록 설정되었을 때 일어나는 모순을 감지하고 이들로 목표를 종료하는데 사용합니다.

source: The intro command can more generally be used to introduce a variable of any type:
ko: intro명령은 폭넓게로는 임의 유형의 변수를 도입하는데 사용됩니다.

source: The intros tactic can be used without any arguments, in which case, it chooses names and introduces as many variables as it can.
ko: intros 전략은 어떠한 인수 없이도 사용될 수 있습니다. 가령, 그것은 이름을 선택할 수 있고, 원하는 한 많이 많은 변수를 도입할 수 있습니다.

source: The map function is even more tedious to define by hand than the tail function.
ko: 심지어 map 함수는 tail 함수보다 손으로 정의하기에는 더 번거롭습니다.

source: The match expression is part of Lean's function definition system, which provides convenient and expressive ways of defining complex functions.
ko: match 표현식은 복잡한 함수를 정의하는데 편리하고 표현력있는 방식을 제공하는 린의 함수 정의 시스템의 일부분입니다.

source: The open command admits variations.
ko: open 명령은 변형을 허용합니다.

source: The open command brings the shorter names into the current context.
ko: open 명령은 현재 맥락에서 짧은 이름을 가져옵니다.

source: The or-elimination rule is slightly more complicated.
ko: or-제거 규칙은 약간 더 복잡합니다.

source: The repeat combinator can be used to apply a tactic several times.
ko: 조합자 repeat는 한 전략을 여러 차례 적용하는데 사용될 수 있습니다.

source: The rewrite tactic (abbreviated rw) and the simp tactic were introduced briefly in Calculational Proofs.
ko: (rw로 축약되는)rewrite 전략과 simp전략은 Calculational Proofs에 간략히 도입되었습니다.

source: The rewrite tactic is not restricted to propositions.
ko: rewrite 전략은 명제에만 국한되지 않습니다.

source: The rewrite tactic provides a basic mechanism for applying substitutions to goals and hypotheses, providing a convenient and efficient way of working with equality.
ko: 동등성에 대해 편리하고 효율적인 방식을 제공하면서 rewrite 전략은 목표와 가정에 치환을 적용하는 기본적인 작동원리를 제공합니다.

source: The rfl tactic is syntax sugar for exact rfl.
ko: rfl은 exact rfl에 대한 문법 설탕입니다.

source: The show command does nothing more than annotate the type, and, internally, all the presentations of t1 that we have seen produce the same term.
ko: show 명령은 유형에 주석을 달 뿐이고, 내부적으로 우리가 본 t1의 모든 나타남이 동일한 용어를 생성할 수 있습니다.

source: The show tactic can actually be used to rewrite a goal to something definitionally equivalent:
ko: show 전략은 실제로 무언가 정의 상으로 동등한 목표를 다시 쓰는데 사용될 수 있습니다.

source: The simp tactic, instead, rewrites the goal by applying the given identities repeatedly, in any order, anywhere they are applicable in a term.
ko: 대신 simp 전략은 주어진 항등식들을 그들이 항에 적용되는 어느 곳이든 임의의 순서대로 반복적으로 사용하여 목표를 다시 씁니다.

source: The sorry identifier magically produces a proof of anything, or provides an object of any data type at all.
ko: sorry 식별자는 어떤 증명이든 마법같이 만듭니다. 혹은 임의의 데이터 유형의 객체를 제공합니다.

source: The structure command, available in Lean, provides infrastructure to support this process.
ko: 린에서 사용할 수 있는 structure 명령은 이 절차를 지원하는 기반구조를 제공합니다.

source: The structure command is especially useful for defining algebraic structures, and Lean provides substantial infrastructure to support working with them.
ko: structure 명령은 대수적 구조를 정의하는데 특히 유용합니다. 그리고 린은 이들과 작업을 지원하는 중요한 기반구조를 제공합니다.

source: The tail function is, however, easy to define using recursive equations, and the equation compiler generates all the boilerplate code automatically for us.
ko: 하지만 tail 함수는 재귀적인 방정식을 사용해 정의하기 쉽습니다. 그리고 방정식 컴파일러는 모든 보일러 플레이트 코드를 우리를 위해 자동적으로 만들어 줍니다.

source: The variable command instructs Lean to insert the declared variables as bound variables in definitions that refer to them by name.
ko: variable명령은 Lean에게 선언된 변수를 그들을 이름으로 참조하는 정의의 구속 변수로 삽입하라고 지시합니다.

source: The cases tactic can be used to decompose any element of an inductively defined type; constructor always applies the first applicable constructor of an inductively defined type.
ko: cases 전략은 유도적으로 정의된 유형의 임의의 원소를 분해하는데 사용될 수 있습니다. constructor는 항상 유도적으로 정의된 유형의 처음으로 활용할 수 있는 생성자에 적용할 수 있습니다.

source: The cond function is a boolean conditional: cond b t1 t2 returns t1 if b is true, and t2 otherwise.
ko: cond 함수는 조건 불리언입니다. cond b t1 t2은 b가 참이면 t1을 그렇지 않으면 t2를 반환합니다.

source: The exact command is just a variant of apply which signals that the expression given should fill the goal exactly.
ko: exact 명령은 목표와 동일한 표현식임을 알리는 apply의 변형일 뿐입니다.

source: The injection tactic is designed to make use of this fact:
ko: injection 전략은 이 사실을 사용하도록 설계되었습니다.

source: The match statement "destructs" the existential assertion into the components w and hw, which can then be used in the body of the statement to prove the proposition.
ko: match 구문은 존재 주장 속 성분인 w와 hw로 '파괴'합니다. 이들은 명제를 증명하기 위해 문장의 몸체에서 사용될 수 있습니다.

source: The sorry does not prevent the bytecode evaluator from evaluating the function successfully.
ko: sorry는 바이트코드 평가기가 함수를 성공적으로 평가하는 것을 막지 못합니다.

source: The try combinator builds a tactic that always succeeds, though possibly in a trivial way: try t executes t and reports success, even if t fails.
ko: 대개 명백한 방식일지라도 try 조합자는 항상 성공하는 전략을 만들고, t가 실패했음에도 try t는 t를 실행하고 성공을 보고합니다.
